it/src/Documents/РаспределениеЛицензий/РаспределениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЛицензий</name>
  <registerRecords>AccumulationRegister.РазмещениеЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУстановлено</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Enums/ВидДвиженияНакопления/ВидДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвиженияНакопления</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

it/src/Documents/РаспределениеЛицензий/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуРаспределениеЛицензий(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаспределениеЛицензийОсновныеСредства.Ссылка КАК Регистратор,
	               |	РаспределениеЛицензийОсновныеСредства.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА РаспределениеЛицензийОсновныеСредства.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Приход)
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения,
	               |	РаспределениеЛицензийОсновныеСредства.Лицензия,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |	РаспределениеЛицензийОсновныеСредства.Количество КАК Количество,
	               |	РаспределениеЛицензийОсновныеСредства.Ссылка.Организация,
	               |	РаспределениеЛицензийОсновныеСредства.ПодразделениеОрганизации,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторКомпьютера,
	               |	РаспределениеЛицензийОсновныеСредства.Лицензия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	ИСТИНА КАК Активность
	               |ИЗ
	               |	Документ.РаспределениеЛицензий.ОсновныеСредства КАК РаспределениеЛицензийОсновныеСредства
	               |ГДЕ
	               |	РаспределениеЛицензийОсновныеСредства.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции // ПолучитьТаблицуКомплектующих()
 
 Функция ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	РаспределениеЛицензийОсновныеСредства.Ссылка КАК Регистратор,
	                |	РаспределениеЛицензийОсновныеСредства.Ссылка.Дата КАК Период,
	                |	ВЫБОР
	                |		КОГДА РаспределениеЛицензийОсновныеСредства.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Приход)
	                |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                |	КОНЕЦ КАК ВидДвижения,
	                |	РаспределениеЛицензийОсновныеСредства.Лицензия,
	                |	РаспределениеЛицензийОсновныеСредства.Количество КАК Количество,
	                |	РаспределениеЛицензийОсновныеСредства.Ссылка.Организация,
	                |	РаспределениеЛицензийОсновныеСредства.Лицензия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	                |	ИСТИНА КАК Активность
	                |ИЗ
	                |	Документ.РаспределениеЛицензий.ОсновныеСредства КАК РаспределениеЛицензийОсновныеСредства
	                |ГДЕ
	                |	РаспределениеЛицензийОсновныеСредства.Ссылка = &Ссылка";
			 
			 
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции //ПолучитьТаблицуЛицензииОрганизации
